// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисКонфигурации;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "cf-file", Описание = "Путь к файлу конфигурации (*.cf)")
Перем ПутьКФайлуCf;

&ПараметрИнструмента(Имя = "OUT", Описание = "Каталог выгрузки исходников конфигурации")
Перем КаталогВыгрузки;

&Инструмент(Имя = "cf-decompile", Описание = "Разобрать конфигурацию в исходники")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаCfDecompile();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Разобрать конфигурацию в исходники выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисКонфигурации", СервисКонфигурации);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ПутьКФайлуCf <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуCf", ПутьКФайлуCf);
	КонецЕсли;

	Если КаталогВыгрузки <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "КаталогВыгрузки", КаталогВыгрузки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
