// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисКонфигурации;

&Пластилин
Перем СервисЗаполненияПараметров;

&Пластилин
Перем СервисОкружения;

&ПараметрИнструмента(Имя = "OUT", Описание = "Путь к файлу cf (*.cf)")
Перем ПутьКФайлуCf;

&ПараметрИнструмента(Имя = "src", Описание = "Каталог исходников конфигурации (по умолчанию - текущий каталог)")
Перем КаталогИсходников;

&ПараметрИнструмента(Имя = "list", Описание = "Список файлов для выборочной загрузки")
Перем СписокФайлов;

&Инструмент(Имя = "cf-compile", Описание = "Собрать конфигурацию из исходников")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаCfCompile();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Собрать конфигурацию из исходников выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисКонфигурации", СервисКонфигурации);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);
	Рефлектор.УстановитьСвойство(Команда, "СервисОкружения", СервисОкружения);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ПутьКФайлуCf <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуCf", ПутьКФайлуCf);
	КонецЕсли;

	Если КаталогИсходников <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "КаталогИсходников", КаталогИсходников);
	КонецЕсли;

	Если СписокФайлов <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "СписокФайлов", СписокФайлов);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
