// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&ПараметрИнструмента(Имя = "ibcmd", Описание = "Использовать утилиту ibcmd вместо конфигуратора", Тип = "boolean")
Перем ИспользоватьIbcmd;

&Инструмент(Имя = "ibcmd-options", Описание = "Установить опции работы через утилиту ibcmd")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	НаборОпций = КонтекстMCP.НаборОпцийIbcmd();

	Если ИспользоватьIbcmd <> Неопределено Тогда
		НаборОпций.ИспользоватьIbcmd = ИспользоватьIbcmd;
	КонецЕсли;

	Ответ = Новый Соответствие;
	Если НаборОпций.ИспользоватьIbcmd <> Неопределено Тогда
		Ответ.Вставить("ibcmd", НаборОпций.ИспользоватьIbcmd);
	КонецЕсли;

	Возврат Ответ;

КонецФункции
