// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&ПараметрИнструмента(Имя = "storage-name", Описание = "Адрес хранилища конфигурации")
Перем АдресХранилища;

&ПараметрИнструмента(Имя = "storage-user", Описание = "Пользователь хранилища конфигурации")
Перем ПользовательХранилища;

&ПараметрИнструмента(Имя = "storage-pwd", Описание = "Пароль хранилища конфигурации")
Перем ПарольХранилища;

&ПараметрИнструмента(Имя = "storage-ver", Описание = "Номер версии хранилища")
Перем ВерсияХранилища;

&Инструмент(Имя = "storage-options", Описание = "Установить опции хранилища конфигурации")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	НаборОпций = КонтекстMCP.НаборОпцийХранилища();

	Если АдресХранилища <> Неопределено Тогда
		НаборОпций.АдресХранилища = АдресХранилища;
	КонецЕсли;
	Если ПользовательХранилища <> Неопределено Тогда
		НаборОпций.ПользовательХранилища = ПользовательХранилища;
	КонецЕсли;
	Если ПарольХранилища <> Неопределено Тогда
		НаборОпций.ПарольХранилища = ПарольХранилища;
	КонецЕсли;
	Если ВерсияХранилища <> Неопределено Тогда
		НаборОпций.ВерсияХранилища = ВерсияХранилища;
	КонецЕсли;

	Ответ = Новый Соответствие;
	Если НаборОпций.АдресХранилища <> Неопределено Тогда
		Ответ.Вставить("storage-name", НаборОпций.АдресХранилища);
	КонецЕсли;
	Если НаборОпций.ПользовательХранилища <> Неопределено Тогда
		Ответ.Вставить("storage-user", "********");
	КонецЕсли;
	Если НаборОпций.ПарольХранилища <> Неопределено Тогда
		Ответ.Вставить("storage-pwd", "********");
	КонецЕсли;
	Если НаборОпций.ВерсияХранилища <> Неопределено Тогда
		Ответ.Вставить("storage-ver", НаборОпций.ВерсияХранилища);
	КонецЕсли;

	Возврат Ответ;

КонецФункции
