// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&ПараметрИнструмента(Имя = "dbms-type", Описание = "Тип СУБД. Значения: MSSQLServer, PostgreSQL, IBMDB2, OracleDatabase")
Перем ТипСУБД;

&ПараметрИнструмента(Имя = "dbms-server", Описание = "Адрес сервера СУБД")
Перем СерверСУБД;

&ПараметрИнструмента(Имя = "dbms-base", Описание = "Имя базы данных СУБД")
Перем ИмяБазыДанных;

&ПараметрИнструмента(Имя = "dbms-user", Описание = "Пользователь СУБД")
Перем ПользовательСУБД;

&ПараметрИнструмента(Имя = "dbms-pwd", Описание = "Пароль СУБД")
Перем ПарольСУБД;

&Инструмент(Имя = "dbms-options", Описание = "Установить опции СУБД")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	НаборОпций = КонтекстMCP.НаборОпцийСУБД();

	Если ТипСУБД <> Неопределено Тогда
		НаборОпций.ТипСУБД = ТипСУБД;
	КонецЕсли;
	Если СерверСУБД <> Неопределено Тогда
		НаборОпций.СерверСУБД = СерверСУБД;
	КонецЕсли;
	Если ИмяБазыДанных <> Неопределено Тогда
		НаборОпций.ИмяБазыДанных = ИмяБазыДанных;
	КонецЕсли;
	Если ПользовательСУБД <> Неопределено Тогда
		НаборОпций.ПользовательСУБД = ПользовательСУБД;
	КонецЕсли;
	Если ПарольСУБД <> Неопределено Тогда
		НаборОпций.ПарольСУБД = ПарольСУБД;
	КонецЕсли;

	Ответ = Новый Соответствие;
	Если НаборОпций.ТипСУБД <> Неопределено Тогда
		Ответ.Вставить("dbms-type", НаборОпций.ТипСУБД);
	КонецЕсли;
	Если НаборОпций.СерверСУБД <> Неопределено Тогда
		Ответ.Вставить("dbms-server", НаборОпций.СерверСУБД);
	КонецЕсли;
	Если НаборОпций.ИмяБазыДанных <> Неопределено Тогда
		Ответ.Вставить("dbms-base", НаборОпций.ИмяБазыДанных);
	КонецЕсли;
	Если НаборОпций.ПользовательСУБД <> Неопределено Тогда
		Ответ.Вставить("dbms-user", "********");
	КонецЕсли;
	Если НаборОпций.ПарольСУБД <> Неопределено Тогда
		Ответ.Вставить("dbms-pwd", "********");
	КонецЕсли;

	Возврат Ответ;

КонецФункции
