// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&ПараметрИнструмента(Имя = "settings", Описание = "Путь к файлу настроек (JSON)")
Перем ФайлНастроек;

&Инструмент(Имя = "settings-options", Описание = "Установить путь к файлу настроек")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	НаборОпций = КонтекстMCP.НаборОпцийНастроек();

	Если ФайлНастроек <> Неопределено Тогда
		НаборОпций.ФайлНастроек = ФайлНастроек;
	КонецЕсли;

	Ответ = Новый Соответствие;
	Если НаборОпций.ФайлНастроек <> Неопределено Тогда
		Ответ.Вставить("settings", НаборОпций.ФайлНастроек);
	КонецЕсли;

	Возврат Ответ;

КонецФункции
