// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&ПараметрИнструмента(Имя = "cluster-admin", Описание = "Имя администратора кластера серверов")
Перем АдминистраторКластера;

&ПараметрИнструмента(Имя = "cluster-pwd", Описание = "Пароль администратора кластера серверов")
Перем ПарольКластера;

&Инструмент(Имя = "admin-options", Описание = "Установить опции администрирования кластера серверов 1С")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	НаборОпций = КонтекстMCP.НаборОпцийАдминистрирования();

	Если АдминистраторКластера <> Неопределено Тогда
		НаборОпций.АдминистраторКластера = АдминистраторКластера;
	КонецЕсли;
	Если ПарольКластера <> Неопределено Тогда
		НаборОпций.ПарольКластера = ПарольКластера;
	КонецЕсли;

	Ответ = Новый Соответствие;
	Если НаборОпций.АдминистраторКластера <> Неопределено Тогда
		Ответ.Вставить("cluster-admin", "********");
	КонецЕсли;
	Если НаборОпций.ПарольКластера <> Неопределено Тогда
		Ответ.Вставить("cluster-pwd", "********");
	КонецЕсли;

	Возврат Ответ;

КонецФункции
