// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисПлатформы;

&Пластилин
Перем СервисКонфигурации;

&Пластилин
Перем СервисЗаполненияПараметров;

&Пластилин
Перем СервисРасчетаИнкремента;

&ПараметрИнструмента(Имя = "source", Описание = "Источник конфигурации (каталог исходников, *.cf или *.dt файл)")
Перем Источник;

&Инструмент(Имя = "infobase_init", Описание = "Инициализировать информационную базу")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ИнициализироватьИнформационнуюБазу() Экспорт

	Команда = Новый ПодкомандаInfobaseInit();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Инициализация информационной базы завершена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисПлатформы", СервисПлатформы);
	Рефлектор.УстановитьСвойство(Команда, "СервисКонфигурации", СервисКонфигурации);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);
	Рефлектор.УстановитьСвойство(Команда, "СервисРасчетаИнкремента", СервисРасчетаИнкремента);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если Источник <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "Источник", Источник);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
