// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисПлатформы;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "OUT", Описание = "Путь к выходному файлу DT (*.dt)")
Перем ПутьКФайлуDT;

&Инструмент(Имя = "infobase-dump-dt", Описание = "Выгрузить информационную базу в файл dt")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаInfobaseDumpDt();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Выгрузить информационную базу в файл dt завершена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисПлатформы", СервисПлатформы);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ПутьКФайлуDT <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуDT", ПутьКФайлуDT);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
