// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "objects", Описание = "Путь к файлу XML со списком объектов")
Перем ПутьКФайлуОбъектов;

&ПараметрИнструмента(Имя = "comment", Описание = "Комментарий к помещаемым объектам")
Перем Комментарий;

&ПараметрИнструмента(Имя = "keep-locked", Описание = "Оставить объекты захваченными после помещения", Тип = "boolean")
Перем ОставитьЗахваченными;

&ПараметрИнструмента(Имя = "force", Описание = "Игнорировать удаленные объекты", Тип = "boolean")
Перем ИгнорироватьУдаленные;

&Инструмент(Имя = "repo-commit", Описание = "Поместить изменения в хранилище")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRepoCommit();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Поместить изменения в хранилище выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисХранилища", СервисХранилища);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ПутьКФайлуОбъектов <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуОбъектов", ПутьКФайлуОбъектов);
	КонецЕсли;

	Если Комментарий <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "Комментарий", Комментарий);
	КонецЕсли;

	Если ОставитьЗахваченными <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ОставитьЗахваченными", ОставитьЗахваченными);
	КонецЕсли;

	Если ИгнорироватьУдаленные <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ИгнорироватьУдаленные", ИгнорироватьУдаленные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
