// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "new-user-name", Описание = "Логин нового пользователя хранилища")
Перем ЛогинПользователя;

&ПараметрИнструмента(Имя = "new-user-pwd", Описание = "Пароль нового пользователя хранилища")
Перем ПарольПользователя;

&Инструмент(Имя = "repo-create-user", Описание = "Создать пользователя хранилища")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRepoCreateUser();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Создать пользователя хранилища завершено";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисХранилища", СервисХранилища);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ЛогинПользователя <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ЛогинПользователя", ЛогинПользователя);
	КонецЕсли;

	Если ПарольПользователя <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПарольПользователя", ПарольПользователя);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
