// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "source-storage-name", Описание = "Адрес хранилища-источника для копирования пользователей")
Перем АдресХранилищаИсточника;

&ПараметрИнструмента(Имя = "source-storage-user", Описание = "Пользователь хранилища-источника")
Перем ПользовательИсточника;

&ПараметрИнструмента(Имя = "source-storage-pwd", Описание = "Пароль хранилища-источника")
Перем ПарольИсточника;

&ПараметрИнструмента(Имя = "restore-deleted", Описание = "Восстановить удаленных пользователей", Тип = "boolean")
Перем ВосстановитьУдаленного;

&Инструмент(Имя = "repo-copy-user", Описание = "Копировать пользователей хранилища")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRepoCopyUser();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Копировать пользователей хранилища выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисХранилища", СервисХранилища);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если АдресХранилищаИсточника <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "АдресХранилищаИсточника", АдресХранилищаИсточника);
	КонецЕсли;

	Если ПользовательИсточника <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПользовательИсточника", ПользовательИсточника);
	КонецЕсли;

	Если ПарольИсточника <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПарольИсточника", ПарольИсточника);
	КонецЕсли;

	Если ВосстановитьУдаленного <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ВосстановитьУдаленного", ВосстановитьУдаленного);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
