// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "objects", Описание = "Путь к файлу XML со списком объектов")
Перем ПутьКФайлуОбъектов;

&ПараметрИнструмента(Имя = "revised", Описание = "Получать захваченные объекты", Тип = "boolean")
Перем ПолучатьЗахваченныеОбъекты;

&Инструмент(Имя = "repo-lock", Описание = "Захватить объекты в хранилище")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRepoLock();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Захватить объекты в хранилище выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисХранилища", СервисХранилища);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ПутьКФайлуОбъектов <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуОбъектов", ПутьКФайлуОбъектов);
	КонецЕсли;

	Если ПолучатьЗахваченныеОбъекты <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПолучатьЗахваченныеОбъекты", ПолучатьЗахваченныеОбъекты);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
