// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "ignore-already-bound", Описание = "Игнорировать наличие подключенного пользователя", Тип = "boolean")
Перем ИгнорироватьНаличиеПодключеннойБД;

&ПараметрИнструмента(Имя = "do-not-replace-cfg", Описание = "Не заменять конфигурацию БД конфигурацией хранилища", Тип = "boolean")
Перем НеЗаменятьКонфигурациюБД;

&Инструмент(Имя = "repo-bind", Описание = "Подключиться к хранилищу конфигурации")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRepoBind();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Подключиться к хранилищу конфигурации выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисХранилища", СервисХранилища);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ИгнорироватьНаличиеПодключеннойБД <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ИгнорироватьНаличиеПодключеннойБД", ИгнорироватьНаличиеПодключеннойБД);
	КонецЕсли;

	Если НеЗаменятьКонфигурациюБД <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "НеЗаменятьКонфигурациюБД", НеЗаменятьКонфигурациюБД);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
