// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисХранилища;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "objects", Описание = "Путь к файлу XML со списком объектов")
Перем ПутьКФайлуОбъектов;

&ПараметрИнструмента(Имя = "force", Описание = "Игнорировать локальные изменения", Тип = "boolean")
Перем ИгнорироватьИзменения;

&Инструмент(Имя = "repo-unlock", Описание = "Отпустить объекты в хранилище")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRepoUnlock();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Отпустить объекты в хранилище выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисХранилища", СервисХранилища);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ПутьКФайлуОбъектов <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуОбъектов", ПутьКФайлуОбъектов);
	КонецЕсли;

	Если ИгнорироватьИзменения <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ИгнорироватьИзменения", ИгнорироватьИзменения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
