// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "drop-db", Описание = "Удалить базу данных в СУБД", Тип = "boolean")
Перем УдалитьБД;

&ПараметрИнструмента(Имя = "clear-db", Описание = "Очистить базу данных в СУБД", Тип = "boolean")
Перем ОчиститьБД;

&Инструмент(Имя = "cluster-remove", Описание = "Удалить информационную базу из кластера")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаClusterRemove();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Удалить информационную базу из кластера завершено";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисКластера", СервисКластера);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииКластера", КонтекстMCP.НаборОпцийКластера());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииАдминистрирования", КонтекстMCP.НаборОпцийАдминистрирования());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если УдалитьБД <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "УдалитьБД", УдалитьБД);
	КонецЕсли;

	Если ОчиститьБД <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ОчиститьБД", ОчиститьБД);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
