// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "ib-locale", Описание = "Локализация ИБ")
Перем ЛокализацияИБ;

&ПараметрИнструмента(Имя = "no-create-db", Описание = "Не создавать базу данных в СУБД", Тип = "boolean")
Перем НеСоздаватьБД;

&ПараметрИнструмента(Имя = "lock-jobs", Описание = "Блокировать регламентные задания при создании", Тип = "boolean")
Перем БлокироватьРегламентныеЗадания;

&Инструмент(Имя = "cluster-create", Описание = "Создать информационную базу в кластере")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаClusterCreate();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Создать информационную базу в кластере завершено";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисКластера", СервисКластера);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииКластера", КонтекстMCP.НаборОпцийКластера());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииАдминистрирования", КонтекстMCP.НаборОпцийАдминистрирования());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ЛокализацияИБ <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ЛокализацияИБ", ЛокализацияИБ);
	КонецЕсли;

	Если НеСоздаватьБД <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "НеСоздаватьБД", НеСоздаватьБД);
	КонецЕсли;

	Если БлокироватьРегламентныеЗадания <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "БлокироватьРегламентныеЗадания", БлокироватьРегламентныеЗадания);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
