#Использовать "../cli"

Перем НаборОпцийПодключения;
Перем НаборОпцийПлатформы;
Перем НаборОпцийСУБД;
Перем НаборОпцийХранилища;
Перем НаборОпцийКластера;
Перем НаборОпцийЗапуска;
Перем НаборОпцийАдминистрирования;
Перем НаборОпцийОбновленияБД;
Перем НаборОпцийНастроек;
Перем НаборОпцийIbcmd;

Функция НаборОпцийПодключения() Экспорт
	Возврат НаборОпцийПодключения;
КонецФункции

Функция НаборОпцийПлатформы() Экспорт
	Возврат НаборОпцийПлатформы;
КонецФункции

Функция НаборОпцийСУБД() Экспорт
	Возврат НаборОпцийСУБД;
КонецФункции

Функция НаборОпцийХранилища() Экспорт
	Возврат НаборОпцийХранилища;
КонецФункции

Функция НаборОпцийКластера() Экспорт
	Возврат НаборОпцийКластера;
КонецФункции

Функция НаборОпцийЗапуска() Экспорт
	Возврат НаборОпцийЗапуска;
КонецФункции

Функция НаборОпцийАдминистрирования() Экспорт
	Возврат НаборОпцийАдминистрирования;
КонецФункции

Функция НаборОпцийОбновленияБД() Экспорт
	Возврат НаборОпцийОбновленияБД;
КонецФункции

Функция НаборОпцийНастроек() Экспорт
	Возврат НаборОпцийНастроек;
КонецФункции

Функция НаборОпцийIbcmd() Экспорт
	Возврат НаборОпцийIbcmd;
КонецФункции

&Желудь
Процедура ПриСозданииОбъекта()

	НаборОпцийПодключения = Новый НаборОпцийПодключения();
	НаборОпцийПлатформы = Новый НаборОпцийПлатформы();
	НаборОпцийСУБД = Новый НаборОпцийСУБД();
	НаборОпцийХранилища = Новый НаборОпцийХранилища();
	НаборОпцийКластера = Новый НаборОпцийКластера();
	НаборОпцийЗапуска = Новый НаборОпцийЗапуска();
	НаборОпцийАдминистрирования = Новый НаборОпцийАдминистрирования();
	НаборОпцийОбновленияБД = Новый НаборОпцийОбновленияБД();
	НаборОпцийНастроек = Новый НаборОпцийНастроек();
	НаборОпцийIbcmd = Новый НаборОпцийIbcmd();

КонецПроцедуры
