// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "permission-code", Описание = "Код допуска к заблокированной ИБ")
Перем КодРазрешения;

&ПараметрИнструмента(Имя = "denied-message", Описание = "Сообщение при попытке начать сеанс")
Перем СообщениеБлокировки;

&Инструмент(Имя = "cluster-session-lock", Описание = "Заблокировать новые сеансы")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаClusterSessionLock();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Заблокировать новые сеансы выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисКластера", СервисКластера);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииКластера", КонтекстMCP.НаборОпцийКластера());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииАдминистрирования", КонтекстMCP.НаборОпцийАдминистрирования());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если КодРазрешения <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "КодРазрешения", КодРазрешения);
	КонецЕсли;

	Если СообщениеБлокировки <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "СообщениеБлокировки", СообщениеБлокировки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
