// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисКластера;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "no-lock", Описание = "Не блокировать новые сеансы перед завершением", Тип = "boolean")
Перем НеБлокировать;

&Инструмент(Имя = "cluster-session-kill", Описание = "Завершить текущие сеансы")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаClusterSessionKill();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Завершить текущие сеансы выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисКластера", СервисКластера);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииКластера", КонтекстMCP.НаборОпцийКластера());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииАдминистрирования", КонтекстMCP.НаборОпцийАдминистрирования());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если НеБлокировать <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "НеБлокировать", НеБлокировать);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
