// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисРасширений;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "extension-name", Описание = "Имя расширения для сравнения")
Перем ИмяРасширения;

&ПараметрИнструмента(Имя = "first-cfe", Описание = "Путь к первому файлу cfe. Если не указан - расширение из базы")
Перем ПервыйФайл;

&ПараметрИнструмента(Имя = "second-cfe", Описание = "Путь ко второму файлу cfe для сравнения")
Перем ВторойФайл;

&ПараметрИнструмента(Имя = "report-file", Описание = "Путь к файлу отчета о сравнении")
Перем ФайлОтчета;

&ПараметрИнструмента(Имя = "report-type", Описание = "Тип отчета")
Перем ТипОтчета;

&ПараметрИнструмента(Имя = "report-format", Описание = "Формат файла отчета")
Перем ФорматОтчета;

&Инструмент(Имя = "cfe-compare", Описание = "Сравнить расширения")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаCfeCompare();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Сравнить расширения выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисРасширений", СервисРасширений);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если ИмяРасширения <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ИмяРасширения", ИмяРасширения);
	КонецЕсли;

	Если ПервыйФайл <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПервыйФайл", ПервыйФайл);
	КонецЕсли;

	Если ВторойФайл <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ВторойФайл", ВторойФайл);
	КонецЕсли;

	Если ФайлОтчета <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ФайлОтчета", ФайлОтчета);
	КонецЕсли;

	Если ТипОтчета <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ТипОтчета", ТипОтчета);
	КонецЕсли;

	Если ФорматОтчета <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ФорматОтчета", ФорматОтчета);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
