// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисОбработок;

&Пластилин
Перем СервисЗаполненияПараметров;

&Пластилин
Перем СервисОкружения;

&ПараметрИнструмента(Имя = "SRC", Описание = "Каталог с исходниками обработки (по умолчанию - текущий)")
Перем КаталогИсходников;

&ПараметрИнструмента(Имя = "R recursive", Описание = "Рекурсивный поиск обработок", Тип = "boolean")
Перем Рекурсивно;

&ПараметрИнструмента(Имя = "out", Описание = "Каталог для сохранения собранных обработок")
Перем КаталогВыгрузки;

&Инструмент(Имя = "epf-compile", Описание = "Собрать внешние обработки из исходников")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаEpfCompile();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Собрать внешние обработки из исходников выполнена";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисОбработок", СервисОбработок);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);
	Рефлектор.УстановитьСвойство(Команда, "СервисОкружения", СервисОкружения);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииСУБД", КонтекстMCP.НаборОпцийСУБД());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если КаталогИсходников <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "КаталогИсходников", КаталогИсходников);
	КонецЕсли;

	Если Рекурсивно <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "Рекурсивно", Рекурсивно);
	КонецЕсли;

	Если КаталогВыгрузки <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "КаталогВыгрузки", КаталогВыгрузки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
