// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисПлатформы;

&Пластилин
Перем СервисЗаполненияПараметров;

&Пластилин
Перем СервисОкружения;

&ПараметрИнструмента(Имя = "command", Описание = "Строка, передаваемая в параметр запуска /C")
Перем КомандаЗапуска;

&ПараметрИнструмента(Имя = "execute", Описание = "Путь к внешней обработке 1С для запуска в предприятии (поддерживается переменная $runnerRoot)")
Перем ПутьОбработки;

&ПараметрИнструмента(Имя = "url", Описание = "Навигационная ссылка для перехода после старта 1С:Предприятия")
Перем НавигационнаяСсылка;

&ПараметрИнструмента(Имя = "no-wait", Описание = "Не ожидать завершения запущенной команды/действия", Тип = "boolean")
Перем НеОжидать;

&ПараметрИнструмента(Имя = "exitCodePath", Описание = "Путь к файлу статуса выполнения (0=успех, 1=ошибка, 2=предупреждение)")
Перем ПутьКФайлуСтатуса;

&Инструмент(Имя = "run-enterprise", Описание = "Запустить в режиме предприятия")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRunEnterprise();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Запустить в режиме предприятия завершён";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисПлатформы", СервисПлатформы);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);
	Рефлектор.УстановитьСвойство(Команда, "СервисОкружения", СервисОкружения);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииЗапуска", КонтекстMCP.НаборОпцийЗапуска());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если КомандаЗапуска <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "КомандаЗапуска", КомандаЗапуска);
	КонецЕсли;

	Если ПутьОбработки <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьОбработки", ПутьОбработки);
	КонецЕсли;

	Если НавигационнаяСсылка <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "НавигационнаяСсылка", НавигационнаяСсылка);
	КонецЕсли;

	Если НеОжидать <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "НеОжидать", НеОжидать);
	КонецЕсли;

	Если ПутьКФайлуСтатуса <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ПутьКФайлуСтатуса", ПутьКФайлуСтатуса);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
