// BSLLS:MissingVariablesDescription-off Поля &ПараметрИнструмента - описания заданы в аннотациях.

&Пластилин("КонтекстВанессаMCP")
Перем КонтекстMCP;

&Пластилин
Перем СервисПлатформы;

&Пластилин
Перем СервисЗаполненияПараметров;

&ПараметрИнструмента(Имя = "no-wait", Описание = "Не ожидать завершения запущенной команды/действия", Тип = "boolean")
Перем НеОжидать;

&ПараметрИнструмента(Имя = "additional", Описание = "Дополнительные параметры запуска конфигуратора")
Перем ДополнительныеПараметры;

&Инструмент(Имя = "run-designer", Описание = "Запустить конфигуратор")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&ВыполнениеИнструмента
Функция ВыполнениеИнструмента() Экспорт

	Команда = Новый ПодкомандаRunDesigner();
	ПрименитьПараметрыККоманде(Команда);
	Команда.ВыполнитьДействие();

	Возврат "Запустить конфигуратор завершён";

КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ПрименитьПараметрыККоманде(Команда)

	Рефлектор = Новый Рефлектор();

	Рефлектор.УстановитьСвойство(Команда, "Лог", Логирование.ПолучитьЛог("vrunner"));
	Рефлектор.УстановитьСвойство(Команда, "СервисПлатформы", СервисПлатформы);
	Рефлектор.УстановитьСвойство(Команда, "СервисЗаполненияПараметров", СервисЗаполненияПараметров);

	Рефлектор.УстановитьСвойство(Команда, "ОпцииПодключения", КонтекстMCP.НаборОпцийПодключения());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииПлатформы", КонтекстMCP.НаборОпцийПлатформы());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииХранилища", КонтекстMCP.НаборОпцийХранилища());
	Рефлектор.УстановитьСвойство(Команда, "ОпцииНастроек", КонтекстMCP.НаборОпцийНастроек());

	Если НеОжидать <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "НеОжидать", НеОжидать);
	КонецЕсли;

	Если ДополнительныеПараметры <> Неопределено Тогда
		Рефлектор.УстановитьСвойство(Команда, "ДополнительныеПараметры", ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
